###############################################################################
#####                         　5章 統計的仮設検定                        #####
###############################################################################
A <- rnorm(50)
B <- rnorm(50)
C <- A*0.5+sqrt(0.75)*B
自尊感情 <- 10*A+50
ソーシャルスキル <- 10*C+50

plot(自尊感情, ソーシャルスキル, xlim=c(0, 100), ylim=c(0, 100))
points(50, 50, cex=45)
legend(50, 10, legend="data", pch=1)
legend(10, 100, legend="no relation ship")

##### 標準正規分布を用いた検定 母分散が既知
心理学テスト <- ceiling(runif(n=20, min=0, max=20))
#帰無仮設と対立仮設
#H_0 μ = 12 母平均は12である
#H_1 μ != 12

#統計検定量を求める
Z分子 <- mean(心理学テスト) - 12
Z分子

Z分母 <- sqrt(10/length(心理学テスト))
Z分母

Z統計量 <- Z分子/Z分母
Z統計量

#棄却息を求める
#下側0.025 2.5%
qnorm(0.025)
#下側0.975
qnorm(0.975)

qnorm(0.025, lower.tail=FALSE)

curve(dnorm(x), -3, 3)
abline(v=qnorm(0.025))
abline(v=qnorm(0.975))


##### t分布を用いた検定 母分散が未知
心理学テスト <- ceiling(runif(n=20, min=0, max=20))
#帰無仮設と対立仮設
#H_0 μ = 12 母平均は12である
#H_1 μ != 12

#統計検定量を求める
t分子 <- mean(心理学テスト) - 12
t分子

t分母 <- sqrt(var(心理学テスト)/length(心理学テスト))
t分母

t統計量 <- t分子/t分母
t統計量

#棄却息を求める
#下側0.025 自由度19のt分布
qt(0.025, 19) 
#下側0.975　自由度19のt分布
qt(0.975, 19) 

qnorm(0.025, lower.tail=FALSE)

curve(dnorm(x), -3, 3)
abline(v=qnorm(0.025))
abline(v=qnorm(0.975))

t.test(心理学テスト, mu=12)


##### 相関係数の検定

統計テスト1 <- ceiling(runif(n=20, min=5, max=15))
統計テスト1

統計テスト2 <- ceiling(runif(n=20, min=7, max=16))
統計テスト2

標本相関 <- cor(統計テスト1, 統計テスト2)
標本相関

サンプルサイズ <- length(統計テスト1)
サンプルサイズ

t分子 <- 標本相関*sqrt(サンプルサイズ-2)
t分子

t分母 <- sqrt(1-標本関数^2)
t分母

t統計量 <- t分子/t分母
t統計量

qt(0.025, 18) #自由度18のt分布 下側確率0.025
qt(0.975, 18) #自由度18のt分布 下側確率0.025


pt(4.8057, 18, lower.tail = FALSE)
2*pt(4.8057, 18, lower.tail = FALSE)

cor.test(統計テスト1, 統計テスト2)

##### 独立性の検定 (カイ二乗検定)
数学 <- c("好き", "好き", "嫌い", "好き","好き", "好き", "嫌い", "好き","好き", "好き", "嫌い", "好き","好き", "好き", "嫌い", "好き","好き", "好き", "嫌い", "好き")
統計 <- c("好き", "嫌い", "好き", "嫌い","好き", "嫌い", "好き", "嫌い","好き", "嫌い", "好き", "嫌い","好き", "嫌い", "好き", "嫌い","好き", "嫌い","好き", "嫌い")
table(数学, 統計)

#カイ二乗分布
curve(dchisq(x, 2), 0, 20)
curve(dchisq(x, 1), 0, 20, add=TRUE)
curve(dchisq(x, 4), 0, 20, add=TRUE)
curve(dchisq(x, 8), 0, 20, add=TRUE)

履修A <- matrix(c(16, 12, 4, 8),2,2)
rownames(履修A) <- c("文系", "理系")
colnames(履修A) <- c("履修した", "履修しない")

chisq.test(履修A, correct = FALSE)



履修B <- matrix(c(160, 120, 40, 80),2,2)
rownames(履修B) <- c("文系", "理系")
colnames(履修B) <- c("履修した", "履修しない")

chisq.test(履修B, correct = FALSE)
